## Plan Result (v3-proxy-api-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11167979231)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 0 to change, 3 to destroy.</code></pre>

* Delete
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6
  * aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/V3ProxyApi-Prod:309" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/V3ProxyApi-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
                {
                    environment            = [
                        {
                            name  = "ENVIRONMENT"
                            value = "production"
                        },
                        {
                            name  = "NODE_ENV"
                            value = "production"
                        },
                    ]
                    essential              = true
                    healthCheck            = {
                        command     = [
                            "CMD-SHELL",
                            "curl -f http://localhost:4030/.well-known/server-health || exit 1",
                        ]
                        interval    = 15
                        retries     = 3
                        startPeriod = 0
                        timeout     = 5
                    }
                    image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/v3proxyapi-prod-app:latest"
                    logConfiguration       = {
                        logDriver     = "awslogs"
                        options       = {
                            awslogs-group             = "/Backend/V3ProxyApi-Prod/ecs/app"
                            awslogs-multiline-pattern = "^\\S.+"
                            awslogs-region            = "us-east-1"
                            awslogs-stream-prefix     = "ecs"
                        }
                        secretOptions = []
                    }
                    mountPoints            = []
                    name                   = "app"
                    portMappings           = [
                        {
                            containerPort = 4030
                            hostPort      = 4030
                            protocol      = "tcp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    secrets                = [
                        {
                            name      = "SENTRY_DSN"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/V3ProxyApi/Prod/SENTRY_DSN"
                        },
                        {
                            name      = "UNLEASH_ENDPOINT"
                            valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/Shared/Prod/UNLEASH_ENDPOINT"
                        },
                        {
                            name      = "UNLEASH_KEY"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:V3ProxyApi/Prod/UNLEASH_KEY"
                        },
                    ]
                    systemControls         = []
                    volumesFrom            = []
                },
              ~ {
                  - command                = [
                      - "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                  ~ image                  = "amazon/aws-otel-collector" -> "otel/opentelemetry-collector-contrib"
                  ~ name                   = "aws-otel-collector" -> "otel-collector"
                  ~ portMappings           = [
                        # (1 unchanged element hidden)
                        {
                            containerPort = 4137
                            hostPort      = 4137
                            protocol      = "tcp"
                        },
                      + {
                          + containerPort = 55681
                          + hostPort      = 55681
                          + protocol      = "tcp"
                        },
                    ]
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "V3ProxyApi-Prod" -> (known after apply)
      ~ revision                 = 309 -> (known after apply)
        tags                     = {
            "app_code"       = "pocket"
            "component_code" = "pocket-v3proxyapi"
            "costCenter"     = "Pocket"
            "env_code"       = "prod"
            "environment"    = "Prod"
            "owner"          = "Pocket"
            "service"        = "V3ProxyApi"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6 will be destroyed
  # (because aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6 is not in configuration)
  - resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6" {
      - arn              = "arn:aws:iam::996905175585:policy/V3ProxyApi-Prod-TaskRolePolicy" -> null
      - attachment_count = 1 -> null
      - id               = "arn:aws:iam::996905175585:policy/V3ProxyApi-Prod-TaskRolePolicy" -> null
      - name             = "V3ProxyApi-Prod-TaskRolePolicy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                          - "xray:GetSamplingTargets",
                          - "xray:GetSamplingStatisticSummaries",
                          - "xray:GetSamplingRules",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPA6QHBNZIQ3AF57MQGY" -> null
      - tags             = {
          - "app_code"       = "pocket"
          - "component_code" = "pocket-v3proxyapi"
          - "costCenter"     = "Pocket"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "V3ProxyApi"
        } -> null
      - tags_all         = {
          - "app_code"       = "pocket"
          - "component_code" = "pocket-v3proxyapi"
          - "costCenter"     = "Pocket"
          - "env_code"       = "prod"
          - "environment"    = "Prod"
          - "owner"          = "Pocket"
          - "service"        = "V3ProxyApi"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355 will be destroyed
  # (because aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355 is not in configuration)
  - resource "aws_iam_role_policy_attachment" "application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355" {
      - id         = "V3ProxyApi-Prod-TaskRole-2023021323181831660000000a" -> null
      - policy_arn = "arn:aws:iam::996905175585:policy/V3ProxyApi-Prod-TaskRolePolicy" -> null
      - role       = "V3ProxyApi-Prod-TaskRole" -> null
    }

Plan: 1 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/V3ProxyApi-Prod:309" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":794,"Program":"tfcmt","SHA1":"5463af776c9dc8b242e27c0979c41f286389d17f","Target":"v3-proxy-api-cdk-production","Vars":{},"WorkflowName":"V3 Proxy API"} -->